<a href="https://colab.research.google.com/github/VinuthaTC/vinu111/blob/main/14_12_2022_task.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
pip install pyspark

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyspark
  Downloading pyspark-3.3.1.tar.gz (281.4 MB)
     |████████████████████████████████| 281.4 MB 35 kB/s
Collecting py4j==0.10.9.5
  Downloading py4j-0.10.9.5-py2.py3-none-any.whl (199 kB)
     |████████████████████████████████| 199 kB 51.3 MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.3.1-py2.py3-none-any.whl size=281845512 sha256=96bd0cb0088f8bfd5596de2b915a8fce261ec075acfdb9ef2406b116a60e30f4
  Stored in directory: /root/.cache/pip/wheels/43/dc/11/ec201cd671da62fa9c5cc77078235e40722170ceba231d7598
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.5 pyspark-3.3.1

In [2]:
from pyspark.sql import SparkSession

In [3]:
spark = SparkSession.builder.appName('sparkdf').getOrCreate()

First data frame

In [4]:
data = [["1", "sravan", "company 1"],
        ["2", "ojaswi", "company 1"], 
        ["3", "rohith", "company 2"],
        ["4", "sridevi", "company 1"], 
        ["5", "bobby", "company 1"]]

In [5]:
columns = ['ID', 'NAME', 'Company']

In [6]:
dataframe = spark.createDataFrame(data, columns)
  
dataframe.show()

+---+-------+---------+
| ID|   NAME|  Company|
+---+-------+---------+
|  1| sravan|company 1|
|  2| ojaswi|company 1|
|  3| rohith|company 2|
|  4|sridevi|company 1|
|  5|  bobby|company 1|
+---+-------+---------+

Second data frame

In [7]:
data1 = [["1", "45000", "IT"],
         ["2", "145000", "Manager"],
         ["6", "45000", "HR"],
         ["5", "34000", "Sales"]]

In [8]:
columns = ['ID', 'salary', 'department']

In [9]:
dataframe1 = spark.createDataFrame(data1, columns)
  
dataframe1.show()

+---+------+----------+
| ID|salary|department|
+---+------+----------+
|  1| 45000|        IT|
|  2|145000|   Manager|
|  6| 45000|        HR|
|  5| 34000|     Sales|
+---+------+----------+

inner join

In [10]:
dataframe.join(dataframe1,
               dataframe.ID == dataframe1.ID,
               "inner").show()

+---+------+---------+---+------+----------+
| ID|  NAME|  Company| ID|salary|department|
+---+------+---------+---+------+----------+
|  1|sravan|company 1|  1| 45000|        IT|
|  2|ojaswi|company 1|  2|145000|   Manager|
|  5| bobby|company 1|  5| 34000|     Sales|
+---+------+---------+---+------+----------+

outer join

In [11]:
dataframe.join(dataframe1, 
               dataframe.ID == dataframe1.ID, 
               "outer").show()

+----+-------+---------+----+------+----------+
|  ID|   NAME|  Company|  ID|salary|department|
+----+-------+---------+----+------+----------+
|   1| sravan|company 1|   1| 45000|        IT|
|   2| ojaswi|company 1|   2|145000|   Manager|
|   3| rohith|company 2|null|  null|      null|
|   4|sridevi|company 1|null|  null|      null|
|   5|  bobby|company 1|   5| 34000|     Sales|
|null|   null|     null|   6| 45000|        HR|
+----+-------+---------+----+------+----------+

outer join using full key word

In [12]:
dataframe.join(dataframe1,
               dataframe.ID == dataframe1.ID, 
               "full").show()

+----+-------+---------+----+------+----------+
|  ID|   NAME|  Company|  ID|salary|department|
+----+-------+---------+----+------+----------+
|   1| sravan|company 1|   1| 45000|        IT|
|   2| ojaswi|company 1|   2|145000|   Manager|
|   3| rohith|company 2|null|  null|      null|
|   4|sridevi|company 1|null|  null|      null|
|   5|  bobby|company 1|   5| 34000|     Sales|
|null|   null|     null|   6| 45000|        HR|
+----+-------+---------+----+------+----------+

fullouter keyword

In [13]:
dataframe.join(dataframe1, 
               dataframe.ID == dataframe1.ID,
               "fullouter").show()

+----+-------+---------+----+------+----------+
|  ID|   NAME|  Company|  ID|salary|department|
+----+-------+---------+----+------+----------+
|   1| sravan|company 1|   1| 45000|        IT|
|   2| ojaswi|company 1|   2|145000|   Manager|
|   3| rohith|company 2|null|  null|      null|
|   4|sridevi|company 1|null|  null|      null|
|   5|  bobby|company 1|   5| 34000|     Sales|
|null|   null|     null|   6| 45000|        HR|
+----+-------+---------+----+------+----------+

left join

In [14]:
dataframe.join(dataframe1,
               dataframe.ID == dataframe1.ID, 
               "left").show()

+---+-------+---------+----+------+----------+
| ID|   NAME|  Company|  ID|salary|department|
+---+-------+---------+----+------+----------+
|  1| sravan|company 1|   1| 45000|        IT|
|  2| ojaswi|company 1|   2|145000|   Manager|
|  3| rohith|company 2|null|  null|      null|
|  5|  bobby|company 1|   5| 34000|     Sales|
|  4|sridevi|company 1|null|  null|      null|
+---+-------+---------+----+------+----------+

In [15]:
dataframe.join(dataframe1, 
               dataframe.ID == dataframe1.ID, 
               "leftouter").show()

+---+-------+---------+----+------+----------+
| ID|   NAME|  Company|  ID|salary|department|
+---+-------+---------+----+------+----------+
|  1| sravan|company 1|   1| 45000|        IT|
|  2| ojaswi|company 1|   2|145000|   Manager|
|  3| rohith|company 2|null|  null|      null|
|  5|  bobby|company 1|   5| 34000|     Sales|
|  4|sridevi|company 1|null|  null|      null|
+---+-------+---------+----+------+----------+

In [16]:
dataframe.join(dataframe1, 
               dataframe.ID == dataframe1.ID, 
               "right").show()

+----+------+---------+---+------+----------+
|  ID|  NAME|  Company| ID|salary|department|
+----+------+---------+---+------+----------+
|   1|sravan|company 1|  1| 45000|        IT|
|   2|ojaswi|company 1|  2|145000|   Manager|
|   5| bobby|company 1|  5| 34000|     Sales|
|null|  null|     null|  6| 45000|        HR|
+----+------+---------+---+------+----------+

In [17]:
dataframe.join(dataframe1,
               dataframe.ID == dataframe1.ID, 
               "rightouter").show()

+----+------+---------+---+------+----------+
|  ID|  NAME|  Company| ID|salary|department|
+----+------+---------+---+------+----------+
|   1|sravan|company 1|  1| 45000|        IT|
|   2|ojaswi|company 1|  2|145000|   Manager|
|   5| bobby|company 1|  5| 34000|     Sales|
|null|  null|     null|  6| 45000|        HR|
+----+------+---------+---+------+----------+

 gives only those rows in the left rowset that have a matching row in the right rowset

In [18]:
dataframe.join(dataframe1,
               dataframe.ID == dataframe1.ID, 
               "leftsemi").show()

+---+------+---------+
| ID|  NAME|  Company|
+---+------+---------+
|  1|sravan|company 1|
|  2|ojaswi|company 1|
|  5| bobby|company 1|
+---+------+---------+

# LeftAnti join ( which brings in only rows from the left table that don't have any matching rows from the right table)

In [19]:
dataframe.join(dataframe1,
               dataframe.ID == dataframe1.ID, 
               "leftanti").show()

+---+-------+---------+
| ID|   NAME|  Company|
+---+-------+---------+
|  3| rohith|company 2|
|  4|sridevi|company 1|
+---+-------+---------+

In [20]:
dataframe1.orderBy("salary").show()

+---+------+----------+
| ID|salary|department|
+---+------+----------+
|  2|145000|   Manager|
|  5| 34000|     Sales|
|  6| 45000|        HR|
|  1| 45000|        IT|
+---+------+----------+

In [ ]:
dataframe1.orderBy(dataframe1["salary"].desc()).show()

+---+------+----------+
| ID|salary|department|
+---+------+----------+
|  1| 45000|        IT|
|  6| 45000|        HR|
|  5| 34000|     Sales|
|  2|145000|   Manager|
+---+------+----------+

In [21]:
dataframe1.groupBy('salary').sum().show()

+------+
|salary|
+------+
|145000|
| 45000|
| 34000|
+------+

In [24]:
data = dataframe1.groupBy("department")
data.agg({'salary':'min'}).show()

+----------+-----------+
|department|min(salary)|
+----------+-----------+
|        HR|      45000|
|        IT|      45000|
|   Manager|     145000|
|     Sales|      34000|
+----------+-----------+